; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob81) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate3)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate4)
	(at pallet3 distributor0)
	(clear crate7)
	(at pallet4 distributor1)
	(clear crate5)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot0)
	(clear pallet6)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 306)
	(at truck1 distributor2)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 375)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 depot2)
	(available hoist7)
	(at hoist8 depot0)
	(available hoist8)
	(at hoist9 depot0)
	(available hoist9)
	(at hoist10 distributor1)
	(available hoist10)
	(at hoist11 depot0)
	(available hoist11)
	(at crate0 depot2)
	(on crate0 pallet2)
	(= (weight crate0) 64)
	(at crate1 depot2)
	(on crate1 crate0)
	(= (weight crate1) 68)
	(at crate2 distributor0)
	(on crate2 pallet3)
	(= (weight crate2) 94)
	(at crate3 depot0)
	(on crate3 pallet0)
	(= (weight crate3) 97)
	(at crate4 depot2)
	(on crate4 crate1)
	(= (weight crate4) 36)
	(at crate5 distributor1)
	(on crate5 pallet4)
	(= (weight crate5) 30)
	(at crate6 distributor0)
	(on crate6 crate2)
	(= (weight crate6) 26)
	(at crate7 distributor0)
	(on crate7 crate6)
	(= (weight crate7) 8)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate6)
		(on crate2 crate4)
		(on crate3 crate5)
		(on crate4 pallet3)
		(on crate5 pallet2)
		(on crate6 pallet4)
		(on crate7 pallet0)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist2 crate4 crate1 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 crate1)
   added: (lifting hoist2 crate4) (clear crate1)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 7
2. (lift hoist3 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist3) (on crate7 crate6)
   added: (lifting hoist3 crate7) (clear crate6)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 7
3. (lift hoist8 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist8) (on crate3 pallet0)
   added: (lifting hoist8 crate3) (clear pallet0)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 7
4. (lift hoist10 crate5 pallet4 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist10) (on crate5 pallet4)
   added: (lifting hoist10 crate5) (clear pallet4)
   changed: (fuel-cost) from 3 to 4
   goals met: 0 of 7
5. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 4 to 14
   goals met: 0 of 7
6. (load hoist2 crate4 truck1 depot2)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 36
   goals met: 0 of 7
7. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 14 to 24
   goals met: 0 of 7
8. (lift hoist7 crate1 crate0 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist7) (on crate1 crate0)
   added: (lifting hoist7 crate1) (clear crate0)
   changed: (fuel-cost) from 24 to 25
   goals met: 0 of 7
9. (load hoist3 crate7 truck1 distributor0)
   deleted: (lifting hoist3 crate7)
   added: (in crate7 truck1) (available hoist3)
   changed: (current_load truck1) from 36 to 44
   goals met: 0 of 7
10. (load hoist8 crate3 truck0 depot0)
   deleted: (lifting hoist8 crate3)
   added: (in crate3 truck0) (available hoist8)
   changed: (current_load truck0) from 0 to 97
   goals met: 0 of 7
11. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 25 to 35
   goals met: 0 of 7
12. (unload hoist4 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist4)
   added: (lifting hoist4 crate3)
   changed: (current_load truck0) from 97 to 0
   goals met: 0 of 7
13. (unload hoist3 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist3)
   added: (lifting hoist3 crate4)
   changed: (current_load truck1) from 44 to 8
   goals met: 0 of 7
14. (drop hoist3 crate4 crate6 distributor0)
   deleted: (lifting hoist3 crate4) (clear crate6)
   added: (available hoist3) (at crate4 distributor0) (clear crate4) (on crate4 crate6)
   goals met: 0 of 7
15. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 35 to 45
   goals met: 0 of 7
16. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 45 to 55
   goals met: 0 of 7
17. (unload hoist8 crate7 truck1 depot0)
   deleted: (in crate7 truck1) (available hoist8)
   added: (lifting hoist8 crate7)
   changed: (current_load truck1) from 8 to 0
   goals met: 0 of 7
18. (drop hoist8 crate7 pallet0 depot0)
   deleted: (lifting hoist8 crate7) (clear pallet0)
   added: (available hoist8) (at crate7 depot0) (clear crate7) (on crate7 pallet0)
   goals met: 1 of 7
19. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 55 to 65
   goals met: 1 of 7
20. (lift hoist2 crate0 pallet2 depot2)
   deleted: (at crate0 depot2) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 65 to 66
   goals met: 1 of 7
21. (drop hoist10 crate5 pallet4 distributor1)
   deleted: (lifting hoist10 crate5) (clear pallet4)
   added: (available hoist10) (at crate5 distributor1) (clear crate5) (on crate5 pallet4)
   goals met: 1 of 7
22. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 66 to 76
   goals met: 1 of 7
23. (load hoist2 crate0 truck0 depot2)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 64
   goals met: 1 of 7
24. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 76 to 86
   goals met: 1 of 7
25. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 86 to 96
   goals met: 1 of 7
26. (unload hoist3 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist3)
   added: (lifting hoist3 crate0)
   changed: (current_load truck0) from 64 to 0
   goals met: 1 of 7
27. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 96 to 106
   goals met: 1 of 7
28. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 106 to 116
   goals met: 1 of 7
29. (drop hoist4 crate3 crate5 distributor1)
   deleted: (lifting hoist4 crate3) (clear crate5)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 crate5)
   goals met: 2 of 7
30. (lift hoist10 crate3 crate5 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist10) (on crate3 crate5)
   added: (lifting hoist10 crate3) (clear crate5)
   changed: (fuel-cost) from 116 to 117
   goals met: 1 of 7
31. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 117 to 127
   goals met: 1 of 7
32. (load hoist3 crate0 truck1 distributor0)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck1) (available hoist3)
   changed: (current_load truck1) from 0 to 64
   goals met: 1 of 7
33. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 127 to 137
   goals met: 1 of 7
34. (lift hoist4 crate5 pallet4 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist4) (on crate5 pallet4)
   added: (lifting hoist4 crate5) (clear pallet4)
   changed: (fuel-cost) from 137 to 138
   goals met: 1 of 7
35. (load hoist7 crate1 truck0 depot2)
   deleted: (lifting hoist7 crate1)
   added: (in crate1 truck0) (available hoist7)
   changed: (current_load truck0) from 0 to 68
   goals met: 1 of 7
36. (unload hoist3 crate0 truck1 distributor0)
   deleted: (in crate0 truck1) (available hoist3)
   added: (lifting hoist3 crate0)
   changed: (current_load truck1) from 64 to 0
   goals met: 1 of 7
37. (drop hoist4 crate5 pallet4 distributor1)
   deleted: (lifting hoist4 crate5) (clear pallet4)
   added: (available hoist4) (at crate5 distributor1) (clear crate5) (on crate5 pallet4)
   goals met: 1 of 7
38. (drop hoist3 crate0 crate4 distributor0)
   deleted: (lifting hoist3 crate0) (clear crate4)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 crate4)
   goals met: 1 of 7
39. (drop hoist10 crate3 crate5 distributor1)
   deleted: (lifting hoist10 crate3) (clear crate5)
   added: (available hoist10) (at crate3 distributor1) (clear crate3) (on crate3 crate5)
   goals met: 2 of 7
40. (lift hoist4 crate3 crate5 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 crate5)
   added: (lifting hoist4 crate3) (clear crate5)
   changed: (fuel-cost) from 138 to 139
   goals met: 1 of 7
41. (lift hoist3 crate0 crate4 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 crate4)
   added: (lifting hoist3 crate0) (clear crate4)
   changed: (fuel-cost) from 139 to 140
   goals met: 1 of 7
42. (lift hoist10 crate5 pallet4 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist10) (on crate5 pallet4)
   added: (lifting hoist10 crate5) (clear pallet4)
   changed: (fuel-cost) from 140 to 141
   goals met: 1 of 7
43. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 141 to 151
   goals met: 1 of 7
44. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 151 to 161
   goals met: 1 of 7
45. (drop hoist3 crate0 crate4 distributor0)
   deleted: (lifting hoist3 crate0) (clear crate4)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 crate4)
   goals met: 1 of 7
46. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 161 to 171
   goals met: 1 of 7
47. (drop hoist10 crate5 pallet4 distributor1)
   deleted: (lifting hoist10 crate5) (clear pallet4)
   added: (available hoist10) (at crate5 distributor1) (clear crate5) (on crate5 pallet4)
   goals met: 1 of 7
48. (drop hoist4 crate3 crate5 distributor1)
   deleted: (lifting hoist4 crate3) (clear crate5)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 crate5)
   goals met: 2 of 7
49. (lift hoist10 crate3 crate5 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist10) (on crate3 crate5)
   added: (lifting hoist10 crate3) (clear crate5)
   changed: (fuel-cost) from 171 to 172
   goals met: 1 of 7
50. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 172 to 182
   goals met: 1 of 7
51. (lift hoist4 crate5 pallet4 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist4) (on crate5 pallet4)
   added: (lifting hoist4 crate5) (clear pallet4)
   changed: (fuel-cost) from 182 to 183
   goals met: 1 of 7
52. (load hoist4 crate5 truck0 distributor1)
   deleted: (lifting hoist4 crate5)
   added: (in crate5 truck0) (available hoist4)
   changed: (current_load truck0) from 68 to 98
   goals met: 1 of 7
53. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 183 to 193
   goals met: 1 of 7
54. (lift hoist3 crate0 crate4 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 crate4)
   added: (lifting hoist3 crate0) (clear crate4)
   changed: (fuel-cost) from 193 to 194
   goals met: 1 of 7
55. (load hoist10 crate3 truck1 distributor1)
   deleted: (lifting hoist10 crate3)
   added: (in crate3 truck1) (available hoist10)
   changed: (current_load truck1) from 0 to 97
   goals met: 1 of 7
56. (unload hoist2 crate5 truck0 depot2)
   deleted: (in crate5 truck0) (available hoist2)
   added: (lifting hoist2 crate5)
   changed: (current_load truck0) from 98 to 68
   goals met: 1 of 7
57. (drop hoist2 crate5 pallet2 depot2)
   deleted: (lifting hoist2 crate5) (clear pallet2)
   added: (available hoist2) (at crate5 depot2) (clear crate5) (on crate5 pallet2)
   goals met: 2 of 7
58. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 194 to 204
   goals met: 2 of 7
59. (unload hoist7 crate3 truck1 depot2)
   deleted: (in crate3 truck1) (available hoist7)
   added: (lifting hoist7 crate3)
   changed: (current_load truck1) from 97 to 0
   goals met: 2 of 7
60. (drop hoist7 crate3 crate5 depot2)
   deleted: (lifting hoist7 crate3) (clear crate5)
   added: (available hoist7) (at crate3 depot2) (clear crate3) (on crate3 crate5)
   goals met: 3 of 7
61. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 204 to 214
   goals met: 3 of 7
62. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 214 to 224
   goals met: 3 of 7
63. (load hoist3 crate0 truck1 distributor0)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck1) (available hoist3)
   changed: (current_load truck1) from 0 to 64
   goals met: 3 of 7
64. (lift hoist3 crate4 crate6 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 crate6)
   added: (lifting hoist3 crate4) (clear crate6)
   changed: (fuel-cost) from 224 to 225
   goals met: 3 of 7
65. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   changed: (current_load truck0) from 68 to 104
   goals met: 3 of 7
66. (lift hoist3 crate6 crate2 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist3) (on crate6 crate2)
   added: (lifting hoist3 crate6) (clear crate2)
   changed: (fuel-cost) from 225 to 226
   goals met: 3 of 7
67. (load hoist3 crate6 truck1 distributor0)
   deleted: (lifting hoist3 crate6)
   added: (in crate6 truck1) (available hoist3)
   changed: (current_load truck1) from 64 to 90
   goals met: 3 of 7
68. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 226 to 236
   goals met: 3 of 7
69. (unload hoist4 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist4)
   added: (lifting hoist4 crate6)
   changed: (current_load truck1) from 90 to 64
   goals met: 3 of 7
70. (drop hoist4 crate6 pallet4 distributor1)
   deleted: (lifting hoist4 crate6) (clear pallet4)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 pallet4)
   goals met: 4 of 7
71. (unload hoist4 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist4)
   added: (lifting hoist4 crate0)
   changed: (current_load truck1) from 64 to 0
   goals met: 4 of 7
72. (drop hoist4 crate0 crate6 distributor1)
   deleted: (lifting hoist4 crate0) (clear crate6)
   added: (available hoist4) (at crate0 distributor1) (clear crate0) (on crate0 crate6)
   goals met: 5 of 7
73. (lift hoist3 crate2 pallet3 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist3) (on crate2 pallet3)
   added: (lifting hoist3 crate2) (clear pallet3)
   changed: (fuel-cost) from 236 to 237
   goals met: 5 of 7
74. (load hoist3 crate2 truck0 distributor0)
   deleted: (lifting hoist3 crate2)
   added: (in crate2 truck0) (available hoist3)
   changed: (current_load truck0) from 104 to 198
   goals met: 5 of 7
75. (unload hoist3 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist3)
   added: (lifting hoist3 crate4)
   changed: (current_load truck0) from 198 to 162
   goals met: 5 of 7
76. (drop hoist3 crate4 pallet3 distributor0)
   deleted: (lifting hoist3 crate4) (clear pallet3)
   added: (available hoist3) (at crate4 distributor0) (clear crate4) (on crate4 pallet3)
   goals met: 6 of 7
77. (unload hoist3 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist3)
   added: (lifting hoist3 crate2)
   changed: (current_load truck0) from 162 to 68
   goals met: 6 of 7
78. (drop hoist3 crate2 crate4 distributor0)
   deleted: (lifting hoist3 crate2) (clear crate4)
   added: (available hoist3) (at crate2 distributor0) (clear crate2) (on crate2 crate4)
   goals met: 7 of 7
